zhtlab/KICADKEY/subcpu/Devices/STM32L4/include/stm32l4Rcc.h
/*
 * Copyright (c) 2018 zhtlab
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files
 * (the "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to permit
 * persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 */

#ifndef _STM32L4RCC_H_
#define _STM32L4RCC_H_

/* STM32L433 reference manual  DocID027295 Rev 3 */

#define RCC_CLOCK_HPRETABLE     {0, 0, 0, 0,  0, 0, 0, 0,  1, 2, 3, 4,  6, 7, 8, 9}
#define RCC_CLOCK_PPRETABLE     {0, 0, 0, 0,  1, 2, 3, 4}
typedef struct {
  __IO uint32_t         CR;             /* 0x00 */
#define RCC_CR_PLLSAI1RDY_SHIFT         27
#define RCC_CR_PLLSAI1RDY_MASK          (1 << (RCC_CR_PLLSAI1RDY_SHIFT))
#define RCC_CR_PLLSAI1RDY_NO            (0 << (RCC_CR_PLLSAI1RDY_SHIFT))
#define RCC_CR_PLLSAI1RDY_YES		(1 << (RCC_CR_PLLSAI1RDY_SHIFT))
#define RCC_CR_PLLSAI1ON_SHIFT		26
#define RCC_CR_PLLSAI1ON_MASK		(1 << (RCC_CR_PLLSAI1ON_SHIFT))
#define RCC_CR_PLLSAI1ON_NO		(0 << (RCC_CR_PLLSAI1ON_SHIFT))
#define RCC_CR_PLLSAI1ON_YES		(1 << (RCC_CR_PLLSAI1ON_SHIFT))
#define RCC_CR_PLLRDY_SHIFT		25
#define RCC_CR_PLLRDY_MASK		(1 << (RCC_CR_PLLRDY_SHIFT))
#define RCC_CR_PLLRDY_NO		(0 << (RCC_CR_PLLRDY_SHIFT))
#define RCC_CR_PLLRDY_YES		(1 << (RCC_CR_PLLRDY_SHIFT))
#define RCC_CR_PLLON_SHIFT		24
#define RCC_CR_PLLON_MASK		(1 << (RCC_CR_PLLON_SHIFT))
#define RCC_CR_PLLON_NO                 (0 << (RCC_CR_PLLON_SHIFT))
#define RCC_CR_PLLON_YES		(1 << (RCC_CR_PLLON_SHIFT))
#define RCC_CR_CSSON_SHIFT		19
#define RCC_CR_CSSON_MASK		(1 << (RCC_CR_CSSON_SHIFT))
#define RCC_CR_CSSON_NO                 (0 << (RCC_CR_CSSON_SHIFT))
#define RCC_CR_CSSON_YES		(1 << (RCC_CR_CSSON_SHIFT))
#define RCC_CR_HSEBYP_SHIFT		18
#define RCC_CR_HSEBYP_MASK		(1 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSEBYP_NO		(0 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSEBYP_YES		(1 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSERDY_SHIFT		17
#define RCC_CR_HSERDY_MASK		(1 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSERDY_NO		(0 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSERDY_YES		(1 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSEON_SHIFT		16
#define RCC_CR_HSEON_MASK		(1 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSEON_NO                 (0 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSEON_YES		(1 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSIASFS_SHIFT		11
#define RCC_CR_HSIASFS_MASK		(1 << (RCC_CR_HSIASFS_SHIFT))
#define RCC_CR_HSIASFS_NO		(0 << (RCC_CR_HSIASFS_SHIFT))
#define RCC_CR_HSIASFS_YES		(1 << (RCC_CR_HSIASFS_SHIFT))
#define RCC_CR_HSIRDY_SHIFT		10
#define RCC_CR_HSIRDY_MASK		(1 << (RCC_CR_HSIRDY_SHIFT))
#define RCC_CR_HSIRDY_NO		(0 << (RCC_CR_HSIRDY_SHIFT))
#define RCC_CR_HSIRDY_YES		(1 << (RCC_CR_HSIRDY_SHIFT))
#define RCC_CR_HSIKERON_SHIFT		9
#define RCC_CR_HSIKERON_MASK		(1 << (RCC_CR_HSIKERON_SHIFT))
#define RCC_CR_HSIKERON_NO		(0 << (RCC_CR_HSIKERON_SHIFT))
#define RCC_CR_HSIKERON_YES		(1 << (RCC_CR_HSIKERON_SHIFT))
#define RCC_CR_HSION_SHIFT		8
#define RCC_CR_HSION_MASK		(1 << (RCC_CR_HSION_SHIFT))
#define RCC_CR_HSION_NO                 (0 << (RCC_CR_HSION_SHIFT))
#define RCC_CR_HSION_YES		(1 << (RCC_CR_HSION_SHIFT))
#define RCC_CR_MSIRANGE_SHIFT		4
#define RCC_CR_MSIRANGE_MASK		(0xf << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_100KHZ		(0 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_200KHZ		(1 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_400KHZ		(2 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_800KHZ		(3 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_1MHZ		(4 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_2MHZ		(5 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_4MHZ		(6 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_8MHZ		(7 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_16MHZ		(8 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_24MHZ		(9 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_32MHZ		(10 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRANGE_48MHZ		(11 << (RCC_CR_MSIRANGE_SHIFT))
#define RCC_CR_MSIRGSEL_SHIFT		3
#define RCC_CR_MSIRGSEL_MASK		(1 << (RCC_CR_MSIRGSEL_SHIFT))
#define RCC_CR_MSIRGSEL_CSR		(0 << (RCC_CR_MSIRGSEL_SHIFT))
#define RCC_CR_MSIRGSEL_CR		(1 << (RCC_CR_MSIRGSEL_SHIFT))
#define RCC_CR_MSIPLLEN_SHIFT		2
#define RCC_CR_MSIPLLEN_MASK		(1 << (RCC_CR_MSIPLLEN_SHIFT))
#define RCC_CR_MSIPLLEN_NO		(0 << (RCC_CR_MSIPLLEN_SHIFT))
#define RCC_CR_MSIPLLEN_YES		(1 << (RCC_CR_MSIPLLEN_SHIFT))
#define RCC_CR_MSIRDY_SHIFT		1
#define RCC_CR_MSIRDY_MASK		(1 << (RCC_CR_MSIRDY_SHIFT))
#define RCC_CR_MSIRDY_NO		(0 << (RCC_CR_MSIRDY_SHIFT))
#define RCC_CR_MSIRDY_YES		(1 << (RCC_CR_MSIRDY_SHIFT))
#define RCC_CR_MSION_SHIFT		0
#define RCC_CR_MSION_MASK		(1 << (RCC_CR_MSION_SHIFT))
#define RCC_CR_MSION_NO                 (0 << (RCC_CR_MSION_SHIFT))
#define RCC_CR_MSION_YES                (1 << (RCC_CR_MSION_SHIFT))

  __IO uint32_t         ICSCR;          /* 0x04 */
#define RCC_ICSCR_HSITRIM_SHIFT         24
#define RCC_ICSCR_HSITRIM_MASK          (0x1f << (RCC_ICSCR_HSITRIM_SHIFT))
#define RCC_ICSCR_HSICAL_SHIFT          16
#define RCC_ICSCR_HSICAL_MASK           (0xff << (RCC_ICSCR_HSICAL_SHIFT))
#define RCC_ICSCR_MSITRIM_SHIFT         24
#define RCC_ICSCR_MSITRIM_MASK          (0x1f << (RCC_ICSCR_MSITRIM_SHIFT))
#define RCC_ICSCR_MSICAL_SHIFT          16
#define RCC_ICSCR_MSICAL_MASK           (0xff << (RCC_ICSCR_MSICAL_SHIFT))

  __IO uint32_t         CFGR;           /* 0x08 */
#define RCC_CFGR_MCOPRE_SHIFT           28
#define RCC_CFGR_MCOPRE_MASK            (7 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV1            (0 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV2            (1 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV4		(2 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV7		(3 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV16		(4 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOSEL_SHIFT		24
#define RCC_CFGR_MCOSEL_MASK		(0xf << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_DISABLE		(0 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_SYSCLK		(1 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_MSI		(2 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_HSI6		(3 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_HSE		(4 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_MAINPLL		(5 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_LSI		(6 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_HSI48		(8 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_STOPWUCK_SHIFT		16
#define RCC_CFGR_STOPWUCK_MASK		(1 << (RCC_CFGR_STOPWUCK_SHIFT))
#define RCC_CFGR_STOPWUCK_NO		(0 << (RCC_CFGR_STOPWUCK_SHIFT))
#define RCC_CFGR_STOPWUCK_YES		(1 << (RCC_CFGR_STOPWUCK_SHIFT))
#define RCC_CFGR_PPRE2_SHIFT		11		/* APB2 */
#define RCC_CFGR_PPRE2_MASK		(7 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV1		(0 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV2		(4 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV4		(5 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV8		(6 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV16		(7 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE1_SHIFT		8		/* APB1 */
#define RCC_CFGR_PPRE1_MASK		(7 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV1		(0 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV2		(4 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV4		(5 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV8		(6 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV16		(7 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_HPRE_SHIFT             4               /* AHB */
#define RCC_CFGR_HPRE_MASK		(0xf << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV1		(0 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV2		(8 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV4		(9 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV8		(10 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV16             (11 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV64             (12 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV128            (13 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV256            (14 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV512            (15 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_SWS_SHIFT              2
#define RCC_CFGR_SWS_MASK               (3 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_MSI                (0 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_HSI                (1 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_HSE                (2 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_PLL                (3 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SW_SHIFT               0
#define RCC_CFGR_SW_MASK                (3 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_MSI                 (0 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_HSI                 (1 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_HSE                 (2 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_PLL                 (3 << (RCC_CFGR_SW_SHIFT))

  __IO uint32_t         PLLCFGR;        /* 0x0c */
#define RCC_PLLCFGR_PLLPDIV_SHIFT       27
#define RCC_PLLCFGR_PLLPDIV_MASK        (3 << (RCC_PLLCFGR_PLLPDIV_SHIFT))
#define RCC_PLLCFGR_PLLPDIV_PLLP        (0 << (RCC_PLLCFGR_PLLPDIV_SHIFT))
#define RCC_PLLCFGR_PLLPDIV_VCODIV2     (2 << (RCC_PLLCFGR_PLLPDIV_SHIFT))
#define RCC_PLLCFGR_PLLPDIV_VCODIV3     (3 << (RCC_PLLCFGR_PLLPDIV_SHIFT))
#define RCC_PLLCFGR_PLLPDIV_VCODIV31    (3 << (RCC_PLLCFGR_PLLPDIV_SHIFT))
#define RCC_PLLCFGR_PLLR_SHIFT          25
#define RCC_PLLCFGR_PLLR_MASK           (3 << (RCC_PLLCFGR_PLLR_SHIFT))
#define RCC_PLLCFGR_PLLR_DIV2		(0 << (RCC_PLLCFGR_PLLR_SHIFT))
#define RCC_PLLCFGR_PLLR_DIV4		(1 << (RCC_PLLCFGR_PLLR_SHIFT))
#define RCC_PLLCFGR_PLLR_DIV6		(2 << (RCC_PLLCFGR_PLLR_SHIFT))
#define RCC_PLLCFGR_PLLR_DIV8		(3 << (RCC_PLLCFGR_PLLR_SHIFT))
#define RCC_PLLCFGR_PLLREN_SHIFT        24
#define RCC_PLLCFGR_PLLREN_MASK		(1 << (RCC_PLLCFGR_PLLREN_SHIFT))
#define RCC_PLLCFGR_PLLREN_NO		(0 << (RCC_PLLCFGR_PLLREN_SHIFT))
#define RCC_PLLCFGR_PLLREN_YES		(1 << (RCC_PLLCFGR_PLLREN_SHIFT))
#define RCC_PLLCFGR_PLLQ_SHIFT		21
#define RCC_PLLCFGR_PLLQ_MASK		(3 << (RCC_PLLCFGR_PLLQ_SHIFT))
#define RCC_PLLCFGR_PLLQ_DIV2		(0 << (RCC_PLLCFGR_PLLQ_SHIFT))
#define RCC_PLLCFGR_PLLQ_DIV4		(1 << (RCC_PLLCFGR_PLLQ_SHIFT))
#define RCC_PLLCFGR_PLLQ_DIV6		(2 << (RCC_PLLCFGR_PLLQ_SHIFT))
#define RCC_PLLCFGR_PLLQ_DIV8		(3 << (RCC_PLLCFGR_PLLQ_SHIFT))
#define RCC_PLLCFGR_PLLQEN_SHIFT	20
#define RCC_PLLCFGR_PLLQEN_MASK		(1 << (RCC_PLLCFGR_PLLQEN_SHIFT))
#define RCC_PLLCFGR_PLLQEN_NO		(0 << (RCC_PLLCFGR_PLLQEN_SHIFT))
#define RCC_PLLCFGR_PLLQEN_YES		(1 << (RCC_PLLCFGR_PLLQEN_SHIFT))
#define RCC_PLLCFGR_PLLP_SHIFT		17
#define RCC_PLLCFGR_PLLP_MASK		(1 << (RCC_PLLCFGR_PLLP_SHIFT))
#define RCC_PLLCFGR_PLLP_DIV7		(0 << (RCC_PLLCFGR_PLLP_SHIFT))
#define RCC_PLLCFGR_PLLP_DIV17		(1 << (RCC_PLLCFGR_PLLP_SHIFT))
#define RCC_PLLCFGR_PLLPEN_SHIFT	16
#define RCC_PLLCFGR_PLLPEN_MASK		(1 << (RCC_PLLCFGR_PLLPEN_SHIFT))
#define RCC_PLLCFGR_PLLPEN_NO		(0 << (RCC_PLLCFGR_PLLPEN_SHIFT))
#define RCC_PLLCFGR_PLLPEN_YES		(1 << (RCC_PLLCFGR_PLLPEN_SHIFT))
#define RCC_PLLCFGR_PLLN_SHIFT		8
#define RCC_PLLCFGR_PLLN_MASK		(0x7f << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MULX(x)	(((x) & 0x7f) << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL0_XXX	(0 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL1_XXX	(2 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL7_XXX	(7 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL8		(8 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL9		(9 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL86		(86 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL97_XXX      (87 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLN_MUL127_XXX     (127 << (RCC_PLLCFGR_PLLN_SHIFT))
#define RCC_PLLCFGR_PLLM_SHIFT		4
#define RCC_PLLCFGR_PLLM_MASK		(7 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV1		(0 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV2		(1 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV3		(2 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV4		(3 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV5		(4 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV6		(5 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV7		(6 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLM_DIV8		(7 << (RCC_PLLCFGR_PLLM_SHIFT))
#define RCC_PLLCFGR_PLLSRC_SHIFT	0
#define RCC_PLLCFGR_PLLSRC_MASK		(3 << (RCC_PLLCFGR_PLLSRC_SHIFT))
#define RCC_PLLCFGR_PLLSRC_NONE         (0 << (RCC_PLLCFGR_PLLSRC_SHIFT))
#define RCC_PLLCFGR_PLLSRC_MSI		(1 << (RCC_PLLCFGR_PLLSRC_SHIFT))
#define RCC_PLLCFGR_PLLSRC_HSI16	(2 << (RCC_PLLCFGR_PLLSRC_SHIFT))
#define RCC_PLLCFGR_PLLSRC_HSE		(3 << (RCC_PLLCFGR_PLLSRC_SHIFT))
  __IO uint32_t         PLLSAI1CFGR;    /* 0x10 */
  __IO uint32_t         reserved0x14;   /* 0x14 */
  __IO uint32_t         CIER;           /* 0x1c */
#define RCC_CIER_HSI48_RDYIE_SHIFT      10
#define RCC_CIER_HSI48_RDYIE_MASK	(1 << (RCC_CIER_HSI48_RDYIE_SHIFT))
#define RCC_CIER_HSI48_RDYIE_NO		(0 << (RCC_CIER_HSI48_RDYIE_SHIFT))
#define RCC_CIER_HSI48_RDYIE_YES	(1 << (RCC_CIER_HSI48_RDYIE_SHIFT))
#define RCC_CIER_LSE_CSSIE_SHIFT	9
#define RCC_CIER_LSE_CSSIE_MASK		(1 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSE_CSSIE_NO		(0 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSE_CSSIE_YES		(1 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_PLLSAI1_RDYIE_SHIFT	6
#define RCC_CIER_PLLSAI1_RDYIE_MASK	(1 << (RCC_CIER_PLLSAI1_RDYIE_SHIFT))
#define RCC_CIER_PLLSAI1_RDYIE_NO	(0 << (RCC_CIER_PLLSAI1_RDYIE_SHIFT))
#define RCC_CIER_PLLSAI1_RDYIE_YES	(1 << (RCC_CIER_PLLSAI1_RDYIE_SHIFT))
#define RCC_CIER_PLL_RDYIE_SHIFT	5
#define RCC_CIER_PLL_RDYIE_MASK		(1 << (RCC_CIER_PLL_RDYIE_SHIFT))
#define RCC_CIER_PLL_RDYIE_NO		(0 << (RCC_CIER_PLL_RDYIE_SHIFT))
#define RCC_CIER_PLL_RDYIE_YES		(1 << (RCC_CIER_PLL_RDYIE_SHIFT))
#define RCC_CIER_HSE_RDYIE_SHIFT	4
#define RCC_CIER_HSE_RDYIE_MASK		(1 << (RCC_CIER_HSE_RDYIE_SHIFT))
#define RCC_CIER_HSE_RDYIE_NO		(0 << (RCC_CIER_HSE_RDYIE_SHIFT))
#define RCC_CIER_HSE_RDYIE_YES		(1 << (RCC_CIER_HSE_RDYIE_SHIFT))
#define RCC_CIER_HSI_RDYIE_SHIFT	3
#define RCC_CIER_HSI_RDYIE_MASK		(1 << (RCC_CIER_HSI_RDYIE_SHIFT))
#define RCC_CIER_HSI_RDYIE_NO		(0 << (RCC_CIER_HSI_RDYIE_SHIFT))
#define RCC_CIER_HSI_RDYIE_YES		(1 << (RCC_CIER_HSI_RDYIE_SHIFT))
#define RCC_CIER_MSI_RDYIE_SHIFT	2
#define RCC_CIER_MSI_RDYIE_MASK		(1 << (RCC_CIER_MSI_RDYIE_SHIFT))
#define RCC_CIER_MSI_RDYIE_NO		(0 << (RCC_CIER_MSI_RDYIE_SHIFT))
#define RCC_CIER_MSI_RDYIE_YES		(1 << (RCC_CIER_MSI_RDYIE_SHIFT))
#define RCC_CIER_LSE_RDYIE_SHIFT	1
#define RCC_CIER_LSE_RDYIE_MASK		(1 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSE_RDYIE_NO		(0 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSE_RDYIE_YES		(1 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSI_RDYIE_SHIFT	0
#define RCC_CIER_LSI_RDYIE_MASK		(1 << (RCC_CIER_LSI_RDYIE_SHIFT))
#define RCC_CIER_LSI_RDYIE_NO		(0 << (RCC_CIER_LSI_RDYIE_SHIFT))
#define RCC_CIER_LSI_RDYIE_YES		(1 << (RCC_CIER_LSI_RDYIE_SHIFT))

