zhtlab/KICADKEY/subcpu/Devices/STM32L4/include/stm32l4Rcc.h
  __IO uint32_t         CIFR;           /* 0x1c */
#define RCC_CIFR_HSI48_RDYF_SHIFT	10
#define RCC_CIFR_HSI48_RDYF_MASK	(1 << (RCC_CIFR_HSI48_RDYF_SHIFT))
#define RCC_CIFR_HSI48_RDYF_NO		(0 << (RCC_CIFR_HSI48_RDYF_SHIFT))
#define RCC_CIFR_HSI48_RDYF_YES		(1 << (RCC_CIFR_HSI48_RDYF_SHIFT))
#define RCC_CIFR_LSE_CSSF_SHIFT		9
#define RCC_CIFR_LSE_CSSF_MASK		(1 << (RCC_CIFR_LSE_CSSF_SHIFT))
#define RCC_CIFR_LSE_CSSF_NO		(0 << (RCC_CIFR_LSE_CSSF_SHIFT))
#define RCC_CIFR_LSE_CSSF_YES		(1 << (RCC_CIFR_LSE_CSSF_SHIFT))
#define RCC_CIFR_CSSF_SHIFT		8
#define RCC_CIFR_CSSF_MASK		(1 << (RCC_CIFR_LSE_CSSF_SHIFT))
#define RCC_CIFR_CSSF_NO		(0 << (RCC_CIFR_LSE_CSSF_SHIFT))
#define RCC_CIFR_CSSF_YES		(1 << (RCC_CIFR_LSE_CSSF_SHIFT))
#define RCC_CIFR_PLLSAI1_RDYF_SHIFT	6
#define RCC_CIFR_PLLSAI1_RDYF_MASK	(1 << (RCC_CIFR_PLLSAI1_RDYF_SHIFT))
#define RCC_CIFR_PLLSAI1_RDYF_NO	(0 << (RCC_CIFR_PLLSAI1_RDYF_SHIFT))
#define RCC_CIFR_PLLSAI1_RDYF_YES	(1 << (RCC_CIFR_PLLSAI1_RDYF_SHIFT))
#define RCC_CIFR_PLL_RDYF_SHIFT		5
#define RCC_CIFR_PLL_RDYF_MASK		(1 << (RCC_CIFR_PLL_RDYF_SHIFT))
#define RCC_CIFR_PLL_RDYF_NO		(0 << (RCC_CIFR_PLL_RDYF_SHIFT))
#define RCC_CIFR_PLL_RDYF_YES		(1 << (RCC_CIFR_PLL_RDYF_SHIFT))
#define RCC_CIFR_HSE_RDYF_SHIFT		4
#define RCC_CIFR_HSE_RDYF_MASK		(1 << (RCC_CIFR_HSE_RDYF_SHIFT))
#define RCC_CIFR_HSE_RDYF_NO		(0 << (RCC_CIFR_HSE_RDYF_SHIFT))
#define RCC_CIFR_HSE_RDYF_YES		(1 << (RCC_CIFR_HSE_RDYF_SHIFT))
#define RCC_CIFR_HSI_RDYF_SHIFT		3
#define RCC_CIFR_HSI_RDYF_MASK		(1 << (RCC_CIFR_HSI_RDYF_SHIFT))
#define RCC_CIFR_HSI_RDYF_NO		(0 << (RCC_CIFR_HSI_RDYF_SHIFT))
#define RCC_CIFR_HSI_RDYF_YES		(1 << (RCC_CIFR_HSI_RDYF_SHIFT))
#define RCC_CIFR_MSI_RDYF_SHIFT		2
#define RCC_CIFR_MSI_RDYF_MASK		(1 << (RCC_CIFR_MSI_RDYF_SHIFT))
#define RCC_CIFR_MSI_RDYF_NO		(0 << (RCC_CIFR_MSI_RDYF_SHIFT))
#define RCC_CIFR_MSI_RDYF_YES		(1 << (RCC_CIFR_MSI_RDYF_SHIFT))
#define RCC_CIFR_LSE_RDYF_SHIFT		1
#define RCC_CIFR_LSE_RDYF_MASK		(1 << (RCC_CIFR_LSE_RDYF_SHIFT))
#define RCC_CIFR_LSE_RDYF_NO		(0 << (RCC_CIFR_LSE_RDYF_SHIFT))
#define RCC_CIFR_LSE_RDYF_YES		(1 << (RCC_CIFR_LSE_RDYF_SHIFT))
#define RCC_CIFR_LSI_RDYF_SHIFT		0
#define RCC_CIFR_LSI_RDYF_MASK		(1 << (RCC_CIFR_LSI_RDYF_SHIFT))
#define RCC_CIFR_LSI_RDYF_NO		(0 << (RCC_CIFR_LSI_RDYF_SHIFT))
#define RCC_CIFR_LSI_RDYF_YES		(1 << (RCC_CIFR_LSI_RDYF_SHIFT))
  __IO uint32_t         CICR;           /* 0x20 */
#define RCC_CICR_HSI48_RDYC_SHIFT	10
#define RCC_CICR_HSI48_RDYC_MASK	(1 << (RCC_CICR_HSI48_RDYC_SHIFT))
#define RCC_CICR_HSI48_RDYC_NO		(0 << (RCC_CICR_HSI48_RDYC_SHIFT))
#define RCC_CICR_HSI48_RDYC_YES		(1 << (RCC_CICR_HSI48_RDYC_SHIFT))
#define RCC_CICR_LSE_CSSC_SHIFT		9
#define RCC_CICR_LSE_CSSC_MASK		(1 << (RCC_CICR_LSE_CSSC_SHIFT))
#define RCC_CICR_LSE_CSSC_NO		(0 << (RCC_CICR_LSE_CSSC_SHIFT))
#define RCC_CICR_LSE_CSSC_YES		(1 << (RCC_CICR_LSE_CSSC_SHIFT))
#define RCC_CICR_CSSC_SHIFT		8
#define RCC_CICR_CSSC_MASK		(1 << (RCC_CICR_LSE_CSSC_SHIFT))
#define RCC_CICR_CSSC_NO		(0 << (RCC_CICR_LSE_CSSC_SHIFT))
#define RCC_CICR_CSSC_YES		(1 << (RCC_CICR_LSE_CSSC_SHIFT))
#define RCC_CICR_PLLSAI1_RDYC_SHIFT	6
#define RCC_CICR_PLLSAI1_RDYC_MASK	(1 << (RCC_CICR_PLLSAI1_RDYC_SHIFT))
#define RCC_CICR_PLLSAI1_RDYC_NO	(0 << (RCC_CICR_PLLSAI1_RDYC_SHIFT))
#define RCC_CICR_PLLSAI1_RDYC_YES	(1 << (RCC_CICR_PLLSAI1_RDYC_SHIFT))
#define RCC_CICR_PLL_RDYC_SHIFT		5
#define RCC_CICR_PLL_RDYC_MASK		(1 << (RCC_CICR_PLL_RDYC_SHIFT))
#define RCC_CICR_PLL_RDYC_NO		(0 << (RCC_CICR_PLL_RDYC_SHIFT))
#define RCC_CICR_PLL_RDYC_YES		(1 << (RCC_CICR_PLL_RDYC_SHIFT))
#define RCC_CICR_HSE_RDYC_SHIFT		4
#define RCC_CICR_HSE_RDYC_MASK		(1 << (RCC_CICR_HSE_RDYC_SHIFT))
#define RCC_CICR_HSE_RDYC_NO		(0 << (RCC_CICR_HSE_RDYC_SHIFT))
#define RCC_CICR_HSE_RDYC_YES		(1 << (RCC_CICR_HSE_RDYC_SHIFT))
#define RCC_CICR_HSI_RDYC_SHIFT		3
#define RCC_CICR_HSI_RDYC_MASK		(1 << (RCC_CICR_HSI_RDYC_SHIFT))
#define RCC_CICR_HSI_RDYC_NO		(0 << (RCC_CICR_HSI_RDYC_SHIFT))
#define RCC_CICR_HSI_RDYC_YES		(1 << (RCC_CICR_HSI_RDYC_SHIFT))
#define RCC_CICR_MSI_RDYC_SHIFT		2
#define RCC_CICR_MSI_RDYC_MASK		(1 << (RCC_CICR_MSI_RDYC_SHIFT))
#define RCC_CICR_MSI_RDYC_NO		(0 << (RCC_CICR_MSI_RDYC_SHIFT))
#define RCC_CICR_MSI_RDYC_YES		(1 << (RCC_CICR_MSI_RDYC_SHIFT))
#define RCC_CICR_LSE_RDYC_SHIFT		1
#define RCC_CICR_LSE_RDYC_MASK		(1 << (RCC_CICR_LSE_RDYC_SHIFT))
#define RCC_CICR_LSE_RDYC_NO		(0 << (RCC_CICR_LSE_RDYC_SHIFT))
#define RCC_CICR_LSE_RDYC_YES		(1 << (RCC_CICR_LSE_RDYC_SHIFT))
#define RCC_CICR_LSI_RDYC_SHIFT		0
#define RCC_CICR_LSI_RDYC_MASK		(1 << (RCC_CICR_LSI_RDYC_SHIFT))
#define RCC_CICR_LSI_RDYC_NO		(0 << (RCC_CICR_LSI_RDYC_SHIFT))
#define RCC_CICR_LSI_RDYC_YES		(1 << (RCC_CICR_LSI_RDYC_SHIFT))
  __IO uint32_t         reserved0x24;   /* 0x24 */
  __IO uint32_t         AHB1RSTR;       /* 0x28 */
#define RCC_APB1RSTR1_CRSRST_SHIFT      24
#define RCC_APB1RSTR1_CRSRST_MASK       (1 << (RCC_APB1RSTR1_CRSRST_SHIFT))
#define RCC_APB1RSTR1_CRSRST_NO         (0 << (RCC_APB1RSTR1_CRSRST_SHIFT))
#define RCC_APB1RSTR1_CRSRST_YES        (1 << (RCC_APB1RSTR1_CRSRST_SHIFT))

  __IO uint32_t         AHB2RSTR;       /* 0x2c */
  __IO uint32_t         AHB3RSTR;       /* 0x30 */
  __IO uint32_t         reserved0x34;   /* 0x34 */
  __IO uint32_t         APB1RSTR1;      /* 0x38 */
  __IO uint32_t         APB1RSTR2;      /* 0x3c */
  __IO uint32_t         APB2RSTR;       /* 0x40 */
#define RCC_APB2RSTR_DFSDM1RSTR_SHIFT	24
#define RCC_APB2RSTR_DFSDM1RSTR_MASK	(1 << (RCC_APB2RSTR_DFSDM1RSTR_SHIFT))
#define RCC_APB2RSTR_DFSDM1RSTR_NO	(0 << (RCC_APB2RSTR_DFSDM1RSTR_SHIFT))
#define RCC_APB2RSTR_DFSDM1RSTR_YES	(1 << (RCC_APB2RSTR_DFSDM1RSTR_SHIFT))
#define RCC_APB2RSTR_SAI1RSTR_SHIFT	21
#define RCC_APB2RSTR_SAI1RSTR_MASK	(1 << (RCC_APB2RSTR_SAI1RSTR_SHIFT))
#define RCC_APB2RSTR_SAI1RSTR_NO	(0 << (RCC_APB2RSTR_SAI1RSTR_SHIFT))
#define RCC_APB2RSTR_SAI1RSTR_YES	(1 << (RCC_APB2RSTR_SAI1RSTR_SHIFT))
#define RCC_APB2RSTR_TIM16RSTR_SHIFT	17
#define RCC_APB2RSTR_TIM16RSTR_MASK	(1 << (RCC_APB2RSTR_TIM16RSTR_SHIFT))
#define RCC_APB2RSTR_TIM16RSTR_NO	(0 << (RCC_APB2RSTR_TIM16RSTR_SHIFT))
#define RCC_APB2RSTR_TIM16RSTR_YES	(1 << (RCC_APB2RSTR_TIM16RSTR_SHIFT))
#define RCC_APB2RSTR_TIM15RSTR_SHIFT	16
#define RCC_APB2RSTR_TIM15RSTR_MASK	(1 << (RCC_APB2RSTR_TIM15RSTR_SHIFT))
#define RCC_APB2RSTR_TIM15RSTR_NO	(0 << (RCC_APB2RSTR_TIM15RSTR_SHIFT))
#define RCC_APB2RSTR_TIM15RSTR_YES	(1 << (RCC_APB2RSTR_TIM15RSTR_SHIFT))
#define RCC_APB2RSTR_USART1RSTR_SHIFT	14
#define RCC_APB2RSTR_USART1RSTR_MASK	(1 << (RCC_APB2RSTR_USART1RSTR_SHIFT))
#define RCC_APB2RSTR_USART1RSTR_NO	(0 << (RCC_APB2RSTR_USART1RSTR_SHIFT))
#define RCC_APB2RSTR_USART1RSTR_YES	(1 << (RCC_APB2RSTR_USART1RSTR_SHIFT))
#define RCC_APB2RSTR_SPI1RSTR_SHIFT	12
#define RCC_APB2RSTR_SPI1RSTR_MASK	(1 << (RCC_APB2RSTR_SPI1RSTR_SHIFT))
#define RCC_APB2RSTR_SPI1RSTR_NO	(0 << (RCC_APB2RSTR_SPI1RSTR_SHIFT))
#define RCC_APB2RSTR_SPI1RSTR_YES	(1 << (RCC_APB2RSTR_SPI1RSTR_SHIFT))
#define RCC_APB2RSTR_TIM1RSTR_SHIFT	11
#define RCC_APB2RSTR_TIM1RSTR_MASK	(1 << (RCC_APB2RSTR_TIM1RSTR_SHIFT))
#define RCC_APB2RSTR_TIM1RSTR_NO	(0 << (RCC_APB2RSTR_TIM1RSTR_SHIFT))
#define RCC_APB2RSTR_TIM1RSTR_YES	(1 << (RCC_APB2RSTR_TIM1RSTR_SHIFT))
#define RCC_APB2RSTR_SDMMC1RSTR_SHIFT	10
#define RCC_APB2RSTR_SDMMC1RSTR_MASK	(1 << (RCC_APB2RSTR_SDMMC1RSTR_SHIFT))
#define RCC_APB2RSTR_SDMMC1RSTR_NO	(0 << (RCC_APB2RSTR_SDMMC1RSTR_SHIFT))
#define RCC_APB2RSTR_SDMMC1RSTR_YES	(1 << (RCC_APB2RSTR_SDMMC1RSTR_SHIFT))
#define RCC_APB2RSTR_FWRSTR_SHIFT	7
#define RCC_APB2RSTR_FWRSTR_MASK	(1 << (RCC_APB2RSTR_FWRSTR_SHIFT))
#define RCC_APB2RSTR_FWRSTR_NO		(0 << (RCC_APB2RSTR_FWRSTR_SHIFT))
#define RCC_APB2RSTR_FWRSTR_YES		(1 << (RCC_APB2RSTR_FWRSTR_SHIFT))
#define RCC_APB2RSTR_SYSCFGRSTR_SHIFT	0
#define RCC_APB2RSTR_SYSCFGRSTR_MASK	(1 << (RCC_APB2RSTR_SYSCFGRSTR_SHIFT))
#define RCC_APB2RSTR_SYSCFGRSTR_NO	(0 << (RCC_APB2RSTR_SYSCFGRSTR_SHIFT))
#define RCC_APB2RSTR_SYSCFGRSTR_YES	(1 << (RCC_APB2RSTR_SYSCFGRSTR_SHIFT))

