zhtlab/KICADKEY/subcpu/Devices/STM32L4/include/stm32l4Rcc.h
  __IO uint32_t         reserved0x44;   /* 0x44 */
  __IO uint32_t         AHB1ENR;        /* 0x48 */
#define RCC_AHB1ENR_TSCEN_SHIFT		16
#define RCC_AHB1ENR_TSCEN_MASK		(1 << (RCC_AHB1ENR_TSCEN_SHIFT))
#define RCC_AHB1ENR_TSCEN_NO		(0 << (RCC_AHB1ENR_TSCEN_SHIFT))
#define RCC_AHB1ENR_TSCEN_YES		(1 << (RCC_AHB1ENR_TSCEN_SHIFT))
#define RCC_AHB1ENR_CRCEN_SHIFT		12
#define RCC_AHB1ENR_CRCEN_MASK		(1 << (RCC_AHB1ENR_CRCEN_SHIFT))
#define RCC_AHB1ENR_CRCEN_NO		(0 << (RCC_AHB1ENR_CRCEN_SHIFT))
#define RCC_AHB1ENR_CRCEN_YES		(1 << (RCC_AHB1ENR_CRCEN_SHIFT))
#define RCC_AHB1ENR_FLASHEN_SHIFT	8
#define RCC_AHB1ENR_FLASHEN_MASK	(1 << (RCC_AHB1ENR_FLASHEN_SHIFT))
#define RCC_AHB1ENR_FLASHEN_NO		(0 << (RCC_AHB1ENR_FLASHEN_SHIFT))
#define RCC_AHB1ENR_FLASHEN_YES		(1 << (RCC_AHB1ENR_FLASHEN_SHIFT))
#define RCC_AHB1ENR_DMA2EN_SHIFT	1
#define RCC_AHB1ENR_DMA2EN_MASK		(1 << (RCC_AHB1ENR_DMA2EN_SHIFT))
#define RCC_AHB1ENR_DMA2EN_NO		(0 << (RCC_AHB1ENR_DMA2EN_SHIFT))
#define RCC_AHB1ENR_DMA2EN_YES		(1 << (RCC_AHB1ENR_DMA2EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_SHIFT	0
#define RCC_AHB1ENR_DMA1EN_MASK		(1 << (RCC_AHB1ENR_DMA1EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_NO		(0 << (RCC_AHB1ENR_DMA1EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_YES		(1 << (RCC_AHB1ENR_DMA1EN_SHIFT))

  __IO uint32_t         AHB2ENR;        /* 0x4c */
#define RCC_AHB2ENR_GPIOAEN_SHIFT       0
#define RCC_AHB2ENR_GPIOAEN_MASK        (1 << (RCC_AHB2ENR_GPIOAEN_SHIFT))
#define RCC_AHB2ENR_GPIOAEN_NO          (0 << (RCC_AHB2ENR_GPIOAEN_SHIFT))
#define RCC_AHB2ENR_GPIOAEN_YES         (1 << (RCC_AHB2ENR_GPIOAEN_SHIFT))
#define RCC_AHB2ENR_GPIOBEN_SHIFT       1
#define RCC_AHB2ENR_GPIOBEN_MASK        (1 << (RCC_AHB2ENR_GPIOBEN_SHIFT))
#define RCC_AHB2ENR_GPIOBEN_NO          (0 << (RCC_AHB2ENR_GPIOBEN_SHIFT))
#define RCC_AHB2ENR_GPIOBEN_YES         (1 << (RCC_AHB2ENR_GPIOBEN_SHIFT))
#define RCC_AHB2ENR_GPIOCEN_SHIFT       2
#define RCC_AHB2ENR_GPIOCEN_MASK        (1 << (RCC_AHB2ENR_GPIOCEN_SHIFT))
#define RCC_AHB2ENR_GPIOCEN_NO          (0 << (RCC_AHB2ENR_GPIOCEN_SHIFT))
#define RCC_AHB2ENR_GPIOCEN_YES         (1 << (RCC_AHB2ENR_GPIOCEN_SHIFT))
#define RCC_AHB2ENR_GPIODEN_SHIFT       3
#define RCC_AHB2ENR_GPIODEN_MASK        (1 << (RCC_AHB2ENR_GPIODEN_SHIFT))
#define RCC_AHB2ENR_GPIODEN_NO          (0 << (RCC_AHB2ENR_GPIODEN_SHIFT))
#define RCC_AHB2ENR_GPIODEN_YES         (1 << (RCC_AHB2ENR_GPIODEN_SHIFT))
#define RCC_AHB2ENR_GPIOEEN_SHIFT       4
#define RCC_AHB2ENR_GPIOEEN_MASK        (1 << (RCC_AHB2ENR_GPIOEEN_SHIFT))
#define RCC_AHB2ENR_GPIOEEN_NO          (0 << (RCC_AHB2ENR_GPIOEEN_SHIFT))
#define RCC_AHB2ENR_GPIOEEN_YES         (1 << (RCC_AHB2ENR_GPIOEEN_SHIFT))
#define RCC_AHB2ENR_GPIOHEN_SHIFT       7
#define RCC_AHB2ENR_GPIOHEN_MASK        (1 << (RCC_AHB2ENR_GPIOHEN_SHIFT))
#define RCC_AHB2ENR_GPIOHEN_NO          (0 << (RCC_AHB2ENR_GPIOHEN_SHIFT))
#define RCC_AHB2ENR_GPIOHEN_YES         (1 << (RCC_AHB2ENR_GPIOHEN_SHIFT))

#define RCC_GPIOAEN_YES                 (RCC_AHB2ENR_GPIOAEN_YES)
#define RCC_GPIOBEN_YES                 (RCC_AHB2ENR_GPIOBEN_YES)
#define RCC_GPIOCEN_YES                 (RCC_AHB2ENR_GPIOCEN_YES)
#define RCC_GPIODEN_YES                 (RCC_AHB2ENR_GPIODEN_YES)
#define RCC_GPIOEEN_YES                 (RCC_AHB2ENR_GPIOEEN_YES)
#define RCC_GPIOHEN_YES                 (RCC_AHB2ENR_GPIOHEN_YES)

#define RCC_AHB2ENR_ADCEN_SHIFT         13
#define RCC_AHB2ENR_ADCEN_MASK          (1 << (RCC_AHB2ENR_ADCEN_SHIFT))
#define RCC_AHB2ENR_ADCEN_NO            (0 << (RCC_AHB2ENR_ADCEN_SHIFT))
#define RCC_AHB2ENR_ADCEN_YES           (1 << (RCC_AHB2ENR_ADCEN_SHIFT))
#define RCC_AHB2ENR_AESEN_SHIFT         16
#define RCC_AHB2ENR_AESEN_MASK          (1 << (RCC_AHB2ENR_AESEN_SHIFT))
#define RCC_AHB2ENR_AESEN_NO            (0 << (RCC_AHB2ENR_AESEN_SHIFT))
#define RCC_AHB2ENR_AESEN_YES           (1 << (RCC_AHB2ENR_AESEN_SHIFT))
#define RCC_AHB2ENR_RNGEN_SHIFT         17
#define RCC_AHB2ENR_RNGEN_MASK          (1 << (RCC_AHB2ENR_RNGEN_SHIFT))
#define RCC_AHB2ENR_RNGEN_NO            (0 << (RCC_AHB2ENR_RNGEN_SHIFT))
#define RCC_AHB2ENR_RNGEN_YES           (1 << (RCC_AHB2ENR_RNGEN_SHIFT))

  __IO uint32_t         AHB3ENR;        /* 0x50 */
#define RCC_AHB3ENR_QSPIEN_SHIFT        8
#define RCC_AHB3ENR_QSPIEN_MASK         (1 << (RCC_AHB3ENR_QSPIEN_SHIFT))
#define RCC_AHB3ENR_QSPIEN_NO           (0 << (RCC_AHB3ENR_QSPIEN_SHIFT))
#define RCC_AHB3ENR_QSPIEN_YES          (1 << (RCC_AHB3ENR_QSPIEN_SHIFT))

  __IO uint32_t         reserved0x54;   /* 0x54 */
  __IO uint32_t         APB1ENR1;       /* 0x58 */
#define RCC_APB1ENR1_LPTIM1EN_SHIFT	31
#define RCC_APB1ENR1_LPTIM1EN_MASK	(1 << (RCC_APB1ENR1_LPTIM1EN_SHIFT))
#define RCC_APB1ENR1_LPTIM1EN_NO	(0 << (RCC_APB1ENR1_LPTIM1EN_SHIFT))
#define RCC_APB1ENR1_LPTIM1EN_YES	(1 << (RCC_APB1ENR1_LPTIM1EN_SHIFT))
#define RCC_APB1ENR1_OPAMPEN_SHIFT	30
#define RCC_APB1ENR1_OPAMPEN_MASK	(1 << (RCC_APB1ENR1_OPAMPEN_SHIFT))
#define RCC_APB1ENR1_OPAMPEN_NO		(0 << (RCC_APB1ENR1_OPAMPEN_SHIFT))
#define RCC_APB1ENR1_OPAMPEN_YES	(1 << (RCC_APB1ENR1_OPAMPEN_SHIFT))
#define RCC_APB1ENR1_DAC1EN_SHIFT	29
#define RCC_APB1ENR1_DAC1EN_MASK	(1 << (RCC_APB1ENR1_DAC1EN_SHIFT))
#define RCC_APB1ENR1_DAC1EN_NO		(0 << (RCC_APB1ENR1_DAC1EN_SHIFT))
#define RCC_APB1ENR1_DAC1EN_YES		(1 << (RCC_APB1ENR1_DAC1EN_SHIFT))
#define RCC_APB1ENR1_PWREN_SHIFT	28
#define RCC_APB1ENR1_PWREN_MASK		(1 << (RCC_APB1ENR1_PWREN_SHIFT))
#define RCC_APB1ENR1_PWREN_NO		(0 << (RCC_APB1ENR1_PWREN_SHIFT))
#define RCC_APB1ENR1_PWREN_YES		(1 << (RCC_APB1ENR1_PWREN_SHIFT))
#define RCC_APB1ENR1_USBFSEN_SHIFT	26
#define RCC_APB1ENR1_USBFSEN_MASK	(1 << (RCC_APB1ENR1_USBFSEN_SHIFT))
#define RCC_APB1ENR1_USBFSEN_NO		(0 << (RCC_APB1ENR1_USBFSEN_SHIFT))
#define RCC_APB1ENR1_USBFSEN_YES	(1 << (RCC_APB1ENR1_USBFSEN_SHIFT))
#define RCC_APB1ENR1_CAN1EN_SHIFT	25
#define RCC_APB1ENR1_CAN1EN_MASK	(1 << (RCC_APB1ENR1_CAN1EN_SHIFT))
#define RCC_APB1ENR1_CAN1EN_NO		(0 << (RCC_APB1ENR1_CAN1EN_SHIFT))
#define RCC_APB1ENR1_CAN1EN_YES		(1 << (RCC_APB1ENR1_CAN1EN_SHIFT))
#define RCC_APB1ENR1_CRSEN_SHIFT	24
#define RCC_APB1ENR1_CRSEN_MASK		(1 << (RCC_APB1ENR1_CRSEN_SHIFT))
#define RCC_APB1ENR1_CRSEN_NO		(0 << (RCC_APB1ENR1_CRSEN_SHIFT))
#define RCC_APB1ENR1_CRSEN_YES		(1 << (RCC_APB1ENR1_CRSEN_SHIFT))
#define RCC_APB1ENR1_I2C3EN_SHIFT	23
#define RCC_APB1ENR1_I2C3EN_MASK	(1 << (RCC_APB1ENR1_I2C3EN_SHIFT))
#define RCC_APB1ENR1_I2C3EN_NO		(0 << (RCC_APB1ENR1_I2C3EN_SHIFT))
#define RCC_APB1ENR1_I2C3EN_YES		(1 << (RCC_APB1ENR1_I2C3EN_SHIFT))
#define RCC_APB1ENR1_I2C2EN_SHIFT	22
#define RCC_APB1ENR1_I2C2EN_MASK	(1 << (RCC_APB1ENR1_I2C2EN_SHIFT))
#define RCC_APB1ENR1_I2C2EN_NO		(0 << (RCC_APB1ENR1_I2C2EN_SHIFT))
#define RCC_APB1ENR1_I2C2EN_YES		(1 << (RCC_APB1ENR1_I2C2EN_SHIFT))
#define RCC_APB1ENR1_I2C1EN_SHIFT	21
#define RCC_APB1ENR1_I2C1EN_MASK	(1 << (RCC_APB1ENR1_I2C1EN_SHIFT))
#define RCC_APB1ENR1_I2C1EN_NO		(0 << (RCC_APB1ENR1_I2C1EN_SHIFT))
#define RCC_APB1ENR1_I2C1EN_YES		(1 << (RCC_APB1ENR1_I2C1EN_SHIFT))
#define RCC_APB1ENR1_UART4EN_SHIFT	19
#define RCC_APB1ENR1_UART4EN_MASK	(1 << (RCC_APB1ENR1_UART4EN_SHIFT))
#define RCC_APB1ENR1_UART4EN_NO		(0 << (RCC_APB1ENR1_UART4EN_SHIFT))
#define RCC_APB1ENR1_UART4EN_YES	(1 << (RCC_APB1ENR1_UART4EN_SHIFT))
#define RCC_APB1ENR1_USART3EN_SHIFT	18
#define RCC_APB1ENR1_USART3EN_MASK	(1 << (RCC_APB1ENR1_USART3EN_SHIFT))
#define RCC_APB1ENR1_USART3EN_NO	(0 << (RCC_APB1ENR1_USART3EN_SHIFT))
#define RCC_APB1ENR1_USART3EN_YES	(1 << (RCC_APB1ENR1_USART3EN_SHIFT))
#define RCC_APB1ENR1_USART2EN_SHIFT	17
#define RCC_APB1ENR1_USART2EN_MASK	(1 << (RCC_APB1ENR1_USART2EN_SHIFT))
#define RCC_APB1ENR1_USART2EN_NO	(0 << (RCC_APB1ENR1_USART2EN_SHIFT))
#define RCC_APB1ENR1_USART2EN_YES	(1 << (RCC_APB1ENR1_USART2EN_SHIFT))
#define RCC_APB1ENR1_SPI3EN_SHIFT	15
#define RCC_APB1ENR1_SPI3EN_MASK	(1 << (RCC_APB1ENR1_SPI3EN_SHIFT))
#define RCC_APB1ENR1_SPI3EN_NO		(0 << (RCC_APB1ENR1_SPI3EN_SHIFT))
#define RCC_APB1ENR1_SPI3EN_YES		(1 << (RCC_APB1ENR1_SPI3EN_SHIFT))
#define RCC_APB1ENR1_SPI2EN_SHIFT	14
#define RCC_APB1ENR1_SPI2EN_MASK	(1 << (RCC_APB1ENR1_SPI2EN_SHIFT))
#define RCC_APB1ENR1_SPI2EN_NO		(0 << (RCC_APB1ENR1_SPI2EN_SHIFT))
#define RCC_APB1ENR1_SPI2EN_YES		(1 << (RCC_APB1ENR1_SPI2EN_SHIFT))
#define RCC_APB1ENR1_WWDGEN_SHIFT	11
#define RCC_APB1ENR1_WWDGEN_MASK	(1 << (RCC_APB1ENR1_WWDGEN_SHIFT))
#define RCC_APB1ENR1_WWDGEN_NO		(0 << (RCC_APB1ENR1_WWDGEN_SHIFT))
#define RCC_APB1ENR1_WWDGEN_YES		(1 << (RCC_APB1ENR1_WWDGEN_SHIFT))
#define RCC_APB1ENR1_RTCAPBEN_SHIFT	10
#define RCC_APB1ENR1_RTCAPBEN_MASK	(1 << (RCC_APB1ENR1_RTCAPBEN_SHIFT))
#define RCC_APB1ENR1_RTCAPBEN_NO	(0 << (RCC_APB1ENR1_RTCAPBEN_SHIFT))
#define RCC_APB1ENR1_RTCAPBEN_YES	(1 << (RCC_APB1ENR1_RTCAPBEN_SHIFT))
#define RCC_APB1ENR1_LEDEN_SHIFT	9
#define RCC_APB1ENR1_LEDEN_MASK		(1 << (RCC_APB1ENR1_LEDEN_SHIFT))
#define RCC_APB1ENR1_LEDEN_NO		(0 << (RCC_APB1ENR1_LEDEN_SHIFT))
#define RCC_APB1ENR1_LEDEN_YES		(1 << (RCC_APB1ENR1_LEDEN_SHIFT))
#define RCC_APB1ENR1_TIM7EN_SHIFT	5
#define RCC_APB1ENR1_TIM7EN_MASK	(1 << (RCC_APB1ENR1_TIM7EN_SHIFT))
#define RCC_APB1ENR1_TIM7EN_NO		(0 << (RCC_APB1ENR1_TIM7EN_SHIFT))
#define RCC_APB1ENR1_TIM7EN_YES		(1 << (RCC_APB1ENR1_TIM7EN_SHIFT))
#define RCC_APB1ENR1_TIM6EN_SHIFT	4
#define RCC_APB1ENR1_TIM6EN_MASK	(1 << (RCC_APB1ENR1_TIM6EN_SHIFT))
#define RCC_APB1ENR1_TIM6EN_NO		(0 << (RCC_APB1ENR1_TIM6EN_SHIFT))
#define RCC_APB1ENR1_TIM6EN_YES		(1 << (RCC_APB1ENR1_TIM6EN_SHIFT))
#define RCC_APB1ENR1_TIM3EN_SHIFT	1
#define RCC_APB1ENR1_TIM3EN_MASK	(1 << (RCC_APB1ENR1_TIM3EN_SHIFT))
#define RCC_APB1ENR1_TIM3EN_NO		(0 << (RCC_APB1ENR1_TIM3EN_SHIFT))
#define RCC_APB1ENR1_TIM3EN_YES		(1 << (RCC_APB1ENR1_TIM3EN_SHIFT))
#define RCC_APB1ENR1_TIM2EN_SHIFT	0
#define RCC_APB1ENR1_TIM2EN_MASK	(1 << (RCC_APB1ENR1_TIM2EN_SHIFT))
#define RCC_APB1ENR1_TIM2EN_NO		(0 << (RCC_APB1ENR1_TIM2EN_SHIFT))
#define RCC_APB1ENR1_TIM2EN_YES		(1 << (RCC_APB1ENR1_TIM2EN_SHIFT))

  __IO uint32_t         APB1ENR2;       /* 0x5c */
#define RCC_APB1ENR2_LPTIM2EN_SHIFT	5
#define RCC_APB1ENR2_LPTIM2EN_MASK	(1 << (RCC_APB1ENR2_LPTIM2EN_SHIFT))
#define RCC_APB1ENR2_LPTIM2EN_NO	(0 << (RCC_APB1ENR2_LPTIM2EN_SHIFT))
#define RCC_APB1ENR2_LPTIM2EN_YES	(1 << (RCC_APB1ENR2_LPTIM2EN_SHIFT))
#define RCC_APB1ENR2_SWPMI1EN_SHIFT	2
#define RCC_APB1ENR2_SWPMI1EN_MASK	(1 << (RCC_APB1ENR2_SWPMI1EN_SHIFT))
#define RCC_APB1ENR2_SWPMI1EN_NO	(0 << (RCC_APB1ENR2_SWPMI1EN_SHIFT))
#define RCC_APB1ENR2_SWPMI1EN_YES	(1 << (RCC_APB1ENR2_SWPMI1EN_SHIFT))
#define RCC_APB1ENR2_I2C4EN_SHIFT	1
#define RCC_APB1ENR2_I2C4EN_MASK	(1 << (RCC_APB1ENR2_I2C4EN_SHIFT))
#define RCC_APB1ENR2_I2C4EN_NO		(0 << (RCC_APB1ENR2_I2C4EN_SHIFT))
#define RCC_APB1ENR2_I2C4EN_YES		(1 << (RCC_APB1ENR2_I2C4EN_SHIFT))
#define RCC_APB1ENR2_LPUART1EN_SHIFT	0
#define RCC_APB1ENR2_LPUART1EN_MASK	(1 << (RCC_APB1ENR2_LPUART1EN_SHIFT))
#define RCC_APB1ENR2_LPUART1EN_NO	(0 << (RCC_APB1ENR2_LPUART1EN_SHIFT))
#define RCC_APB1ENR2_LPUART1EN_YES	(1 << (RCC_APB1ENR2_LPUART1EN_SHIFT))

  __IO uint32_t         APB2ENR;        /* 0x60 */
#define RCC_APB2ENR_DFSDM1EN_SHIFT	24
#define RCC_APB2ENR_DFSDM1EN_MASK	(1 << (RCC_APB2ENR_DFSDM1EN_SHIFT))
#define RCC_APB2ENR_DFSDM1EN_NO		(0 << (RCC_APB2ENR_DFSDM1EN_SHIFT))
#define RCC_APB2ENR_DFSDM1EN_YES	(1 << (RCC_APB2ENR_DFSDM1EN_SHIFT))
#define RCC_APB2ENR_SAI1EN_SHIFT	21
#define RCC_APB2ENR_SAI1EN_MASK		(1 << (RCC_APB2ENR_SAI1EN_SHIFT))
#define RCC_APB2ENR_SAI1EN_NO		(0 << (RCC_APB2ENR_SAI1EN_SHIFT))
#define RCC_APB2ENR_SAI1EN_YES		(1 << (RCC_APB2ENR_SAI1EN_SHIFT))
#define RCC_APB2ENR_TIM16EN_SHIFT	17
#define RCC_APB2ENR_TIM16EN_MASK	(1 << (RCC_APB2ENR_TIM16EN_SHIFT))
#define RCC_APB2ENR_TIM16EN_NO		(0 << (RCC_APB2ENR_TIM16EN_SHIFT))
#define RCC_APB2ENR_TIM16EN_YES		(1 << (RCC_APB2ENR_TIM16EN_SHIFT))
#define RCC_APB2ENR_TIM15EN_SHIFT	16
#define RCC_APB2ENR_TIM15EN_MASK	(1 << (RCC_APB2ENR_TIM15EN_SHIFT))
#define RCC_APB2ENR_TIM15EN_NO		(0 << (RCC_APB2ENR_TIM15EN_SHIFT))
#define RCC_APB2ENR_TIM15EN_YES		(1 << (RCC_APB2ENR_TIM15EN_SHIFT))
#define RCC_APB2ENR_USART1EN_SHIFT	14
#define RCC_APB2ENR_USART1EN_MASK	(1 << (RCC_APB2ENR_USART1EN_SHIFT))
#define RCC_APB2ENR_USART1EN_NO		(0 << (RCC_APB2ENR_USART1EN_SHIFT))
#define RCC_APB2ENR_USART1EN_YES	(1 << (RCC_APB2ENR_USART1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_SHIFT	12
#define RCC_APB2ENR_SPI1EN_MASK		(1 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_NO		(0 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_YES		(1 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_TIM1EN_SHIFT	11
#define RCC_APB2ENR_TIM1EN_MASK		(1 << (RCC_APB2ENR_TIM1EN_SHIFT))
#define RCC_APB2ENR_TIM1EN_NO		(0 << (RCC_APB2ENR_TIM1EN_SHIFT))
#define RCC_APB2ENR_TIM1EN_YES		(1 << (RCC_APB2ENR_TIM1EN_SHIFT))
#define RCC_APB2ENR_SDMMC1EN_SHIFT	10
#define RCC_APB2ENR_SDMMC1EN_MASK	(1 << (RCC_APB2ENR_SDMMC1EN_SHIFT))
#define RCC_APB2ENR_SDMMC1EN_NO		(0 << (RCC_APB2ENR_SDMMC1EN_SHIFT))
#define RCC_APB2ENR_SDMMC1EN_YES	(1 << (RCC_APB2ENR_SDMMC1EN_SHIFT))
#define RCC_APB2ENR_FWEN_SHIFT		7
#define RCC_APB2ENR_FWEN_MASK		(1 << (RCC_APB2ENR_FWEN_SHIFT))
#define RCC_APB2ENR_FWEN_NO		(0 << (RCC_APB2ENR_FWEN_SHIFT))
#define RCC_APB2ENR_FWEN_YES		(1 << (RCC_APB2ENR_FWEN_SHIFT))
#define RCC_APB2ENR_SYSCFGEN_SHIFT	0
#define RCC_APB2ENR_SYSCFGEN_MASK	(1 << (RCC_APB2ENR_SYSCFGEN_SHIFT))
#define RCC_APB2ENR_SYSCFGEN_NO		(0 << (RCC_APB2ENR_SYSCFGEN_SHIFT))
#define RCC_APB2ENR_SYSCFGEN_YES	(1 << (RCC_APB2ENR_SYSCFGEN_SHIFT))

  __IO uint32_t         reserved0x64;   /* 0x64 */
  __IO uint32_t         AHB1SMENR;      /* 0x68 */
  __IO uint32_t         AHB2SMENR;      /* 0x6c */
  __IO uint32_t         AHB3SMENR;      /* 0x70 */
  __IO uint32_t         reserved0x74;   /* 0x74 */
  __IO uint32_t         APB1SMENR1;     /* 0x78 */
  __IO uint32_t         APB1SMENR2;     /* 0x7c */
  __IO uint32_t         APB2SMENR;      /* 0x80 */
  __IO uint32_t         reserved0x84;   /* 0x84 */
  __IO uint32_t         CCIPR;          /* 0x88 */
#define RCC_CCIPR_SWPMI1SEL_SHIFT       30
#define RCC_CCIPR_SWPMI1SEL_MASK        (1 << (RCC_CCIPR_SWPMI1SEL_SHIFT))
#define RCC_CCIPR_SWPMI1SEL_PCLK1       (0 << (RCC_CCIPR_SWPMI1SEL_SHIFT))
#define RCC_CCIPR_SWPMI1SEL_HSI16       (1 << (RCC_CCIPR_SWPMI1SEL_SHIFT))
#define RCC_CCIPR_ADCSEL_SHIFT          28
#define RCC_CCIPR_ADCSEL_MASK           (3 << (RCC_CCIPR_ADCSEL_SHIFT))
#define RCC_CCIPR_ADCSEL_NONE           (0 << (RCC_CCIPR_ADCSEL_SHIFT))
#define RCC_CCIPR_ADCSEL_PLLSAI1R       (1 << (RCC_CCIPR_ADCSEL_SHIFT))
#define RCC_CCIPR_ADCSEL_RESERVED2      (2 << (RCC_CCIPR_ADCSEL_SHIFT))
#define RCC_CCIPR_ADCSEL_SYSCLK         (3 << (RCC_CCIPR_ADCSEL_SHIFT))
#define RCC_CCIPR_CLK48SEL_SHIFT        26
#define RCC_CCIPR_CLK48SEL_MASK         (3 << (RCC_CCIPR_CLK48SEL_SHIFT))
#define RCC_CCIPR_CLK48SEL_HSI48        (0 << (RCC_CCIPR_CLK48SEL_SHIFT))
#define RCC_CCIPR_CLK48SEL_PLLSAIQ      (1 << (RCC_CCIPR_CLK48SEL_SHIFT))
#define RCC_CCIPR_CLK48SEL_PLLQ         (2 << (RCC_CCIPR_CLK48SEL_SHIFT))
#define RCC_CCIPR_CLK48SEL_MSI          (3 << (RCC_CCIPR_CLK48SEL_SHIFT))
#define RCC_CCIPR_SAI1SEL_SHIFT         22
#define RCC_CCIPR_SAI1SEL_MASK          (3 << (RCC_CCIPR_SAI1SEL_SHIFT))
#define RCC_CCIPR_SAI1SEL_PLLSAI1P      (0 << (RCC_CCIPR_SAI1SEL_SHIFT))
#define RCC_CCIPR_SAI1SEL_RESERVED1     (1 << (RCC_CCIPR_SAI1SEL_SHIFT))
#define RCC_CCIPR_SAI1SEL_PLLP          (2 << (RCC_CCIPR_SAI1SEL_SHIFT))
#define RCC_CCIPR_SAI1SEL_SAI1_EXTCLK   (3 << (RCC_CCIPR_SAI1SEL_SHIFT))
#define RCC_CCIPR_LPTIM2SEL_SHIFT       20
#define RCC_CCIPR_LPTIM2SEL_MASK        (3 << (RCC_CCIPR_LPTIM2SEL_SHIFT))
#define RCC_CCIPR_LPTIM2SEL_PCLK        (0 << (RCC_CCIPR_LPTIM2SEL_SHIFT))
#define RCC_CCIPR_LPTIM2SEL_LSI         (1 << (RCC_CCIPR_LPTIM2SEL_SHIFT))
#define RCC_CCIPR_LPTIM2SEL_HSI16       (2 << (RCC_CCIPR_LPTIM2SEL_SHIFT))
#define RCC_CCIPR_LPTIM2SEL_LSE         (3 << (RCC_CCIPR_LPTIM2SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_SHIFT       18
#define RCC_CCIPR_LPTIM1SEL_MASK        (3 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_PCLK        (0 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_LSI         (1 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_HSI16       (2 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_LSE         (3 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_SHIFT         16
#define RCC_CCIPR_I2C3SEL_MASK          (3 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_PCLK          (0 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_SYSCLK        (1 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_HSI16         (2 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_RESERVED3     (3 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C2SEL_SHIFT         14
#define RCC_CCIPR_I2C2SEL_MASK          (3 << (RCC_CCIPR_I2C2SEL_SHIFT))
#define RCC_CCIPR_I2C2SEL_PCLK          (0 << (RCC_CCIPR_I2C2SEL_SHIFT))
#define RCC_CCIPR_I2C2SEL_SYSCLK        (1 << (RCC_CCIPR_I2C2SEL_SHIFT))
#define RCC_CCIPR_I2C2SEL_HSI16         (2 << (RCC_CCIPR_I2C2SEL_SHIFT))
#define RCC_CCIPR_I2C2SEL_RESERVED3     (3 << (RCC_CCIPR_I2C2SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_SHIFT         12
#define RCC_CCIPR_I2C1SEL_MASK          (3 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_PCLK          (0 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_SYSCLK        (1 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_HSI16         (2 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_RESERVED3     (3 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_SHIFT      10
#define RCC_CCIPR_LPUART1SEL_MASK       (3 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_PCLK       (0 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_SYSCLK     (1 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_HSI16      (2 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_LSE        (3 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_UART4SEL_SHIFT        6
#define RCC_CCIPR_UART4SEL_MASK         (3 << (RCC_CCIPR_UART4SEL_SHIFT))
#define RCC_CCIPR_UART4SEL_PCLK         (0 << (RCC_CCIPR_UART4SEL_SHIFT))
#define RCC_CCIPR_UART4SEL_SYSCLK       (1 << (RCC_CCIPR_UART4SEL_SHIFT))
#define RCC_CCIPR_UART4SEL_HSI16        (2 << (RCC_CCIPR_UART4SEL_SHIFT))
#define RCC_CCIPR_UART4SEL_LSE          (3 << (RCC_CCIPR_UART4SEL_SHIFT))
#define RCC_CCIPR_USART3SEL_SHIFT       4
#define RCC_CCIPR_USART3SEL_MASK        (3 << (RCC_CCIPR_USART3SEL_SHIFT))
#define RCC_CCIPR_USART3SEL_PCLK	(0 << (RCC_CCIPR_USART3SEL_SHIFT))
#define RCC_CCIPR_USART3SEL_SYSCLK	(1 << (RCC_CCIPR_USART3SEL_SHIFT))
#define RCC_CCIPR_USART3SEL_HSI16	(2 << (RCC_CCIPR_USART3SEL_SHIFT))
#define RCC_CCIPR_USART3SEL_LSE		(3 << (RCC_CCIPR_USART3SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_SHIFT	2
#define RCC_CCIPR_USART2SEL_MASK	(3 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_PCLK	(0 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_SYSCLK      (1 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_HSI16       (2 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_LSE         (3 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_SHIFT       0
#define RCC_CCIPR_USART1SEL_MASK        (3 << (RCC_CCIPR_USART1SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_PCLK        (0 << (RCC_CCIPR_USART1SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_SYSCLK      (1 << (RCC_CCIPR_USART1SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_HSI16       (2 << (RCC_CCIPR_USART1SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_LSE         (3 << (RCC_CCIPR_USART1SEL_SHIFT))
  
  __IO uint32_t         reserved0x8c;   /* 0x8c */
  __IO uint32_t         BDCR;           /* 0x90 */
#define RCC_BDCR_LSCOSEL_SHIFT		25
#define RCC_BDCR_LSCOSEL_MASK		(1 << (RCC_BDCR_LSCOSEL_SHIFT))
#define RCC_BDCR_LSCOSEL_NO		(0 << (RCC_BDCR_LSCOSEL_SHIFT))
#define RCC_BDCR_LSCOSEL_YES		(1 << (RCC_BDCR_LSCOSEL_SHIFT))
#define RCC_BDCR_LSCOEN_SHIFT		24
#define RCC_BDCR_LSCOEN_MASK		(1 << (RCC_BDCR_LSCOEN_SHIFT))
#define RCC_BDCR_LSCOEN_NO		(0 << (RCC_BDCR_LSCOEN_SHIFT))
#define RCC_BDCR_LSCOEN_YES		(1 << (RCC_BDCR_LSCOEN_SHIFT))
#define RCC_BDCR_BDRST_SHIFT		16
#define RCC_BDCR_BDRST_MASK		(1 << (RCC_BDCR_BDRST_SHIFT))
#define RCC_BDCR_BDRST_NO		(0 << (RCC_BDCR_BDRST_SHIFT))
#define RCC_BDCR_BDRST_YES		(1 << (RCC_BDCR_BDRST_SHIFT))
#define RCC_BDCR_RTCEN_SHIFT		15
#define RCC_BDCR_RTCEN_MASK		(1 << (RCC_BDCR_RTCEN_SHIFT))
#define RCC_BDCR_RTCEN_NO		(0 << (RCC_BDCR_RTCEN_SHIFT))
#define RCC_BDCR_RTCEN_YES		(1 << (RCC_BDCR_RTCEN_SHIFT))
#define RCC_BDCR_RTCSELSEL_SHIFT        8
#define RCC_BDCR_RTCSELSEL_MASK         (3 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_RTCSELSEL_NONE RCC_BDCR        (0 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_RTCSELSEL_LSE	        (1 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_RTCSELSEL_LSI	        (2 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_RTCSELSEL_HSE	        (3 << (RCC_BDCR_RTCSELSEL_SHIFT))
#define RCC_BDCR_LSECSSD_SHIFT	        6
#define RCC_BDCR_LSECSSD_MASK	        (1 << (RCC_BDCR_LSECSSD_SHIFT))
#define RCC_BDCR_LSECSSD_NO	        (0 << (RCC_BDCR_LSECSSD_SHIFT))
#define RCC_BDCR_LSECSSD_YES	        (1 << (RCC_BDCR_LSECSSD_SHIFT))
#define RCC_BDCR_LSECSSON_SHIFT         5
#define RCC_BDCR_LSECSSON_MASK	        (1 << (RCC_BDCR_LSECSSON_SHIFT))
#define RCC_BDCR_LSECSSON_NO	        (0 << (RCC_BDCR_LSECSSON_SHIFT))
#define RCC_BDCR_LSECSSON_YES           (1 << (RCC_BDCR_LSECSSON_SHIFT))
#define RCC_BDCR_LSEDRVSEL_SHIFT	3
#define RCC_BDCR_LSEDRVSEL_MASK		(3 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEDRVSEL_LOWERCAP	(0 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEDRVSEL_MEDLOWCAP	(1 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEDRVSEL_MEDHIGHCAP	(2 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEDRVSEL_HIGHERCAP	(3 << (RCC_BDCR_LSEDRVSEL_SHIFT))
#define RCC_BDCR_LSEBYP_SHIFT		2
#define RCC_BDCR_LSEBYP_MASK		(1 << (RCC_BDCR_LSEBYP_SHIFT))
#define RCC_BDCR_LSEBYP_NO		(0 << (RCC_BDCR_LSEBYP_SHIFT))
#define RCC_BDCR_LSEBYP_YES		(1 << (RCC_BDCR_LSEBYP_SHIFT))
#define RCC_BDCR_LSERDY_SHIFT		1
#define RCC_BDCR_LSERDY_MASK		(1 << (RCC_BDCR_LSERDY_SHIFT))
#define RCC_BDCR_LSERDY_NO		(0 << (RCC_BDCR_LSERDY_SHIFT))
#define RCC_BDCR_LSERDY_YES		(1 << (RCC_BDCR_EN_SHIFT))
#define RCC_BDCR_LSEON_SHIFT		0
#define RCC_BDCR_LSEON_MASK		(1 << (RCC_BDCR_LSEON_SHIFT))
#define RCC_BDCR_LSEON_NO		(0 << (RCC_BDCR_LSEON_SHIFT))
#define RCC_BDCR_LSEON_YES		(1 << (RCC_BDCR_LSEON_SHIFT))

