zhtlab/KICADKEY/subcpu/Devices/STM32L4/include/stm32l4Rcc.h
  __IO uint32_t                 CSR;    /* 0x94 */
#define RCC_CSR_LPWRRSTF_SHIFT		31
#define RCC_CSR_LPWRRSTF_MASK		(1 << (RCC_CSR_LPWRRSTF_SHIFT))
#define RCC_CSR_LPWRRSTF_NO		(0 << (RCC_CSR_LPWRRSTF_SHIFT))
#define RCC_CSR_LPWRRSTF_YES		(1 << (RCC_CSR_LPWRRSTF_SHIFT))
#define RCC_CSR_WWDGRSTF_SHIFT		30
#define RCC_CSR_WWDGRSTF_MASK		(1 << (RCC_CSR_WWDGRSTF_SHIFT))
#define RCC_CSR_WWDGRSTF_NO		(0 << (RCC_CSR_WWDGRSTF_SHIFT))
#define RCC_CSR_WWDGRSTF_YES		(1 << (RCC_CSR_WWDGRSTF_SHIFT))
#define RCC_CSR_IWWGRSTF_SHIFT		29
#define RCC_CSR_IWWGRSTF_MASK		(1 << (RCC_CSR_IWWGRSTF_SHIFT))
#define RCC_CSR_IWWGRSTF_NO		(0 << (RCC_CSR_IWWGRSTF_SHIFT))
#define RCC_CSR_IWWGRSTF_YES		(1 << (RCC_CSR_IWWGRSTF_SHIFT))
#define RCC_CSR_SFTRSTF_SHIFT		28
#define RCC_CSR_SFTRSTF_MASK		(1 << (RCC_CSR_SFTRSTF_SHIFT))
#define RCC_CSR_SFTRSTF_NO		(0 << (RCC_CSR_SFTRSTF_SHIFT))
#define RCC_CSR_SFTRSTF_YES		(1 << (RCC_CSR_SFTRSTF_SHIFT))
#define RCC_CSR_BORRSTF_SHIFT		27
#define RCC_CSR_BORRSTF_MASK		(1 << (RCC_CSR_BORRSTF_SHIFT))
#define RCC_CSR_BORRSTF_NO		(0 << (RCC_CSR_BORRSTF_SHIFT))
#define RCC_CSR_BORRSTF_YES		(1 << (RCC_CSR_BORRSTF_SHIFT))
#define RCC_CSR_PINRSTF_SHIFT		26
#define RCC_CSR_PINRSTF_MASK		(1 << (RCC_CSR_PINRSTF_SHIFT))
#define RCC_CSR_PINRSTF_NO		(0 << (RCC_CSR_PINRSTF_SHIFT))
#define RCC_CSR_PINRSTF_YES		(1 << (RCC_CSR_PINRSTF_SHIFT))
#define RCC_CSR_OBLRSTF_SHIFT		25
#define RCC_CSR_OBLRSTF_MASK		(1 << (RCC_CSR_OBLRSTF_SHIFT))
#define RCC_CSR_OBLRSTF_NO		(0 << (RCC_CSR_OBLRSTF_SHIFT))
#define RCC_CSR_OBLRSTF_YES		(1 << (RCC_CSR_OBLRSTF_SHIFT))
#define RCC_CSR_FWRSTF_SHIFT		24
#define RCC_CSR_FWRSTF_MASK		(1 << (RCC_CSR_FWRSTF_SHIFT))
#define RCC_CSR_FWRSTF_NO		(0 << (RCC_CSR_FWRSTF_SHIFT))
#define RCC_CSR_FWRSTF_YES		(1 << (RCC_CSR_FWRSTF_SHIFT))
#define RCC_CSR_RMVF_SHIFT		23
#define RCC_CSR_RMVF_MASK		(1 << (RCC_CSR_RMVF_SHIFT))
#define RCC_CSR_RMVF_NO		        (0 << (RCC_CSR_RMVF_SHIFT))
#define RCC_CSR_RMVF_YES		(1 << (RCC_CSR_RMVF_SHIFT))
#define RCC_CSR_MSISRANGE_SHIFT         8
#define RCC_CSR_MSISRANGE_MASK		(0xf << (RCC_CSR_MSISRANGE_SHIFT))
#define RCC_CSR_MSISRANGE_1MHZ		(4 << (RCC_CSR_MSISRANGE_SHIFT))
#define RCC_CSR_MSISRANGE_2MHZ		(5 << (RCC_CSR_MSISRANGE_SHIFT))
#define RCC_CSR_MSISRANGE_4MHZ		(6 << (RCC_CSR_MSISRANGE_SHIFT))
#define RCC_CSR_MSISRANGE_8MHZ		(7 << (RCC_CSR_MSISRANGE_SHIFT))
#define RCC_CSR_LSIRDY_SHIFT		1
#define RCC_CSR_LSIRDY_MASK		(1 << (RCC_CSR_LSIRDY_SHIFT))
#define RCC_CSR_LSIRDY_NO		(0 << (RCC_CSR_LSIRDY_SHIFT))
#define RCC_CSR_LSIRDY_YES		(1 << (RCC_CSR_LSIRDY_SHIFT))
#define RCC_CSR_LSION_SHIFT		0
#define RCC_CSR_LSION_MASK		(1 << (RCC_CSR_LSION_SHIFT))
#define RCC_CSR_LSION_NO		(0 << (RCC_CSR_LSION_SHIFT))
#define RCC_CSR_LSION_YES		(1 << (RCC_CSR_LSION_SHIFT))

  __IO uint32_t         CRRCR;          /* 0x98 */
#define RCC_CRRCR_HSI48CAL_SHIFT        8
#define RCC_CRRCR_HSI48CAL_MASK         (0xff << (RCC_CRRCR_HSI48CAL_SHIFT))
#define RCC_CRRCR_HSI48RDY_SHIFT        1
#define RCC_CRRCR_HSI48RDY_MASK         (1 << (RCC_CRRCR_HSI48RDY_SHIFT))
#define RCC_CRRCR_HSI48RDY_NO           (0 << (RCC_CRRCR_HSI48RDY_SHIFT))
#define RCC_CRRCR_HSI48RDY_YES          (1 << (RCC_CRRCR_HSI48RDY_SHIFT))
#define RCC_CRRCR_HSI48ON_SHIFT         0
#define RCC_CRRCR_HSI48ON_MASK          (1 << (RCC_CRRCR_HSI48ON_SHIFT))
#define RCC_CRRCR_HSI48ON_NO            (0 << (RCC_CRRCR_HSI48ON_SHIFT))
#define RCC_CRRCR_HSI48ON_YES           (1 << (RCC_CRRCR_HSI48ON_SHIFT))

  __IO uint32_t         CCIPR2;         /* 0x9c */
#define RCC_CCIPR2_I2C4SEL_SHIFT        0
#define RCC_CCIPR2_I2C4SEL_MASK         (3 << (RCC_CCIPR2_I2C4SEL_SHIFT))
#define RCC_CCIPR2_I2C4SEL_PCLK         (0 << (RCC_CCIPR2_I2C4SEL_SHIFT))
#define RCC_CCIPR2_I2C4SEL_SYSCLK       (1 << (RCC_CCIPR2_I2C4SEL_SHIFT))
#define RCC_CCIPR2_I2C4SEL_HSI16        (2 << (RCC_CCIPR2_I2C4SEL_SHIFT))
#define RCC_CCIPR2_I2C4SEL_RESERVED3    (3 << (RCC_CCIPR2_I2C4SEL_SHIFT))
} stm32Dev_RCC;

#endif
